Revit 2027 API
NonContinuousRailInfo.IsValidNonContinuousRailName Method
 Checks whether the input name is valid for a non-continuous rail in its associated railing type.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidNonContinuousRailName(
	string name
)
Public Function IsValidNonContinuousRailName (
	name As String
) As Boolean
public:
bool IsValidNonContinuousRailName(
	String^ name
)
member IsValidNonContinuousRailName :
        name : string -> bool
Parameters
name String
 The name to be checked.
Return Value
Boolean
 True if the name is unique for the [!:Autodesk::Revit::DB::Architecture::RailingType], false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The name must be unique within the [!:Autodesk::Revit::DB::Architecture::RailingType] to which the non-continuous rail belongs.
See Also
Reference
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace